; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 373359 1 2 2 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(have_image Planet3 thermograph0)
	(have_image Phenomenon4 infrared1)
	(have_image Star5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Star7 thermograph0)
	(have_image Star8 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (turn_to satellite0 star8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
3. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
4. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 6
5. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
6. (take_image satellite0 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 1 of 6
7. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
8. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 2 of 6
9. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
10. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   goals met: 3 of 6
11. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   goals met: 3 of 6
12. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 4 of 6
13. (turn_to satellite0 planet3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet3)
   goals met: 4 of 6
14. (take_image satellite0 planet3 instrument1 thermograph0)
   added: (have_image planet3 thermograph0)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon4)
   goals met: 5 of 6
16. (take_image satellite0 phenomenon4 instrument1 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 6 of 6
